Revit 2024 API
BuiltInFailures.PerformanceFailures.MultipleLoopsInSketch Property
 Sketch of <element> contains multiple independent loops - splitting it in few independent elements might improve performance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MultipleLoopsInSketch { get; }
Visual Basic
Public Shared ReadOnly Property MultipleLoopsInSketch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MultipleLoopsInSketch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace